# Функция конвертации целого числа в Римские цифры
def printRoman(number):
    num = [1, 4, 5, 9, 10, 40, 50, 90, 100, 400, 500, 900, 1000]
    sym = ["I", "IV", "V", "IX", "X", "XL", "L", "XC", "C", "CD", "D", "CM", "M"]
    i = 12
    result = ''  # Создаем пустую строку для хранения результата

    while number:
        div = number // num[i]
        number %= num[i]

        while div:
            result += sym[i]  # Добавляем римский символ к результату
            div -= 1
        i -= 1

    return result  # Возвращаем строку с римским числом вместо его печати



